
export const PLACEHOLDERS = {
  wardNo: "उदा. १",
  khasraNo: "उदा. १२३/A",
  layoutName: "उदा. गोकुळधाम लेआउट", // New placeholder
  plotNo: "उदा. १०१",
  occupantName: "भोगवटाधारकाचे पूर्ण नाव लिहा",
  ownerName: "मालकाचे पूर्ण नाव लिहा",
  openSpace: "क्षेत्रफळ प्रविष्ट करा",
  length: "लांबी",
  width: "रुंदी",
  area: "क्षेत्रफळ",
  rate: "दर",
  depreciation: "घसारा दर (%)",
  weightage: "भारांक",
  value: "मूल्य (रु)",
  tax: "कराची रक्कम",
  taxRate: "कराचा दर (%)"
};

const getFloorHeaders = (name: string) => [
  `${name} - प्रकार`,
  `${name} - लांबी`,
  `${name} - रुंदी`,
  `${name} - क्षेत्रफळ (चौरस फूट)`,
  `${name} - क्षेत्रफळ (चौरस मीटर)`,
  `${name} - इमारत कराचा दर`,
  `${name} - जमीन  कराचा दर`,
  `${name} - जमीन`,
  `${name} - इमारत`,
  `${name} - घसारा दर`,
  `${name} - भारांक`,
  `${name} - इमारत मूल्य (रुपये)`,
  `${name} - जमीन  मूल्य (रुपये)`,
  `${name} - बांधकाम वर्ष`,
  `${name} - वय`
];

export const EXCEL_HEADERS = [
  "अनुक्रम क्रमांक", "वस्तीचे नाव", "वॉर्ड क्रमांक", "खसरा नंबर / सी टी नंबर", "लेआउटचे नाव", "प्लॉट क्रमांक/मालमत्ता क्र.", "भोगवटाधारकाचे नाव", "मालकाचे नाव", "बांधकाम आहे का", "खाली जागा",
  ...getFloorHeaders("तळ मजला"),
  ...getFloorHeaders("पहिला मजला"),
  ...getFloorHeaders("दुसरा मजला"),
  ...getFloorHeaders("तिसरा मजला"),
  ...getFloorHeaders("चौथा मजला"),
  "मालमत्ता कर", "जमीन कर", "दिवाबत्ती", "आरोग्य", "सामान्य पाणी", "विशेष पाणी", "पावती क्र.", "पावती बुक क्र.", "पावती दिनांक", "एकूण कराची रक्कम", "मागील थकबाकी", "भरलेली रक्कम"
];
